#### Terraform Plan 📋
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.monitoring.kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "pod-security.kubernetes.io/enforce" = "privileged"
            }
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "talos_nocloud_image" {
      + content_type            = "iso"
      + datastore_id            = "local"
      + decompression_algorithm = "gz"
      + file_name               = "talos-v1.11.5-nocloud-amd64.img"
      + id                      = (known after apply)
      + node_name               = "pve01"
      + overwrite               = false
      + overwrite_unmanaged     = false
      + size                    = (known after apply)
      + upload_timeout          = 600
      + url                     = (known after apply)
      + verify                  = true
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_cp" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Managed by Terraform"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "talos-cp-01"
      + network_interface_names              = (known after apply)
      + node_name                            = "pve01"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-pci"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = [
          + "terraform",
        ]
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 40
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.1.210/24"
                  + gateway = "192.168.1.1"
                }
              + ipv6 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"] will be created
  + resource "proxmox_virtual_environment_vm" "talos_workers" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Managed by Terraform"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "talos-worker-01"
      + network_interface_names              = (known after apply)
      + node_name                            = "pve01"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-pci"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = [
          + "terraform",
        ]
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 4
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = 100
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + file_id           = (known after apply)
          + interface         = "virtio0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 40
          + ssd               = false
        }

      + initialization {
          + datastore_id         = "local-lvm"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.1.211/24"
                  + gateway = "192.168.1.1"
                }
              + ipv6 {
                  + address = "dhcp"
                }
            }
        }

      + memory {
          + dedicated      = 8192
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin will be created
  + resource "helm_release" "proxmox_csi_plugin" {
      + atomic                     = false
      + chart                      = "proxmox-csi-plugin"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "proxmox-csi-plugin"
      + namespace                  = "csi-proxmox"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/sergelogvinov/charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                storageClass:
                  - name: proxmox-csi
                    cache: writethrough
                    fstype: ext4
                    reclaimPolicy: Retain
                    ssd: false
                    storage: raid1
                    mountOptions:
                      - noatime
            EOT,
        ]
      + verify                     = false
      + version                    = "0.5.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.proxmox_csi_plugin.kubernetes_namespace.csi-proxmox will be created
  + resource "kubernetes_namespace" "csi-proxmox" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "pod-security.kubernetes.io/audit"   = "baseline"
              + "pod-security.kubernetes.io/enforce" = "privileged"
              + "pod-security.kubernetes.io/warn"    = "baseline"
            }
          + name             = "csi-proxmox"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin will be created
  + resource "kubernetes_secret" "proxmox-csi-plugin" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "proxmox-csi-plugin"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi will be created
  + resource "proxmox_virtual_environment_role" "csi" {
      + id         = (known after apply)
      + privileges = [
          + "Datastore.Allocate",
          + "Datastore.AllocateSpace",
          + "Datastore.Audit",
          + "VM.Audit",
          + "VM.Config.Disk",
        ]
      + role_id    = "CSI"
    }

  # module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi will be created
  + resource "proxmox_virtual_environment_user" "kubernetes-csi" {
      + comment         = "User for Proxmox CSI Plugin"
      + enabled         = true
      + expiration_date = "1970-01-01T00:00:00Z"
      + id              = (known after apply)
      + user_id         = "kubernetes-csi@pve"

      + acl {
          + path      = "/"
          + propagate = true
          + role_id   = "CSI"
        }
    }

  # module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token will be created
  + resource "proxmox_virtual_environment_user_token" "kubernetes-csi-token" {
      + comment               = "Token for Proxmox CSI Plugin"
      + id                    = (known after apply)
      + privileges_separation = false
      + token_name            = "csi"
      + user_id               = "kubernetes-csi@pve"
      + value                 = (sensitive value)
    }

  # module.sealed-secrets.helm_release.sealed_secrets will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealed-secrets-controller"
      + namespace                  = "sealed-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://registry-1.docker.io/bitnamicharts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                namespace: sealed-secrets
                keyrenewperiod: 8766h # ~ 1 year
                
                resources:
                  limits:
                    cpu: 100m
                    memory: 64Mi
                  requests:
                    cpu: 10m
                    memory: 32Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "2.5.19"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.sealed-secrets.kubernetes_namespace.sealed-secrets will be created
  + resource "kubernetes_namespace" "sealed-secrets" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "sealed-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.sealed-secrets.kubernetes_secret.sealed-secrets-key will be created
  + resource "kubernetes_secret" "sealed-secrets-key" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/tls"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "sealedsecrets.bitnami.com/sealed-secrets-key-primary" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "sealedsecrets.bitnami.com/sealed-secrets-key" = "active"
            }
          + name             = "sealed-secrets-bootstrap-key"
          + namespace        = "sealed-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.talos.data.talos_client_configuration.talosconfig will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "talosconfig" {
      + client_configuration = (known after apply)
      + cluster_name         = "cluster01"
      + endpoints            = [
          + "192.168.1.210",
        ]
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # module.talos.data.talos_cluster_health.health will be read during apply
  # (config refers to values not yet known)
 <= data "talos_cluster_health" "health" {
      + client_configuration = (known after apply)
      + control_plane_nodes  = [
          + "192.168.1.210",
        ]
      + endpoints            = [
          + "192.168.1.210",
        ]
      + id                   = (known after apply)
      + timeouts             = {
          + read = "10m"
        }
      + worker_nodes         = [
          + "192.168.1.211",
        ]
    }

  # module.talos.data.talos_image_factory_urls.this will be read during apply
  # (config refers to values not yet known)
 <= data "talos_image_factory_urls" "this" {
      + architecture  = "amd64"
      + id            = (known after apply)
      + platform      = "nocloud"
      + schematic_id  = (known after apply)
      + talos_version = "v1.11.5"
      + urls          = (known after apply)
    }

  # module.talos.data.talos_machine_configuration.machineconfig_cp will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_cp" {
      + cluster_endpoint      = "https://192.168.1.210:6443"
      + cluster_name          = "cluster01"
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
    }

  # module.talos.data.talos_machine_configuration.machineconfig_worker will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_worker" {
      + cluster_endpoint      = "https://192.168.1.210:6443"
      + cluster_name          = "cluster01"
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "worker"
    }

  # module.talos.talos_cluster_kubeconfig.kubeconfig will be created
  + resource "talos_cluster_kubeconfig" "kubeconfig" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = (known after apply)
      + endpoint                        = "192.168.1.210"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "192.168.1.210"
      + timeouts                        = {}
    }

  # module.talos.talos_image_factory_schematic.this will be created
  + resource "talos_image_factory_schematic" "this" {
      + id        = (known after apply)
      + schematic = <<-EOT
            "customization":
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/i915-ucode"
                - "siderolabs/intel-ucode"
                - "siderolabs/iscsi-tools"
                - "siderolabs/qemu-guest-agent"
                - "siderolabs/util-linux-tools"
        EOT
    }

  # module.talos.talos_machine_bootstrap.bootstrap will be created
  + resource "talos_machine_bootstrap" "bootstrap" {
      + client_configuration = (known after apply)
      + endpoint             = "192.168.1.210"
      + id                   = (known after apply)
      + node                 = "192.168.1.210"
    }

  # module.talos.talos_machine_configuration_apply.cp_config_apply[0] will be created
  + resource "talos_machine_configuration_apply" "cp_config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + config_patches              = [
          + <<-EOT
                machine:
                  network:
                    hostname: talos-cp-01
                    nameservers:
                      # Use cluster CoreDNS for DNS resolution
                      - 10.96.0.10
                      - 1.1.1.1
                      - 8.8.8.8
                  features:
                    hostDNS:
                      enabled: false
                  kubelet:
                      extraArgs:
                        rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
                
                cluster:
                  allowSchedulingOnControlPlanes: true
                  network:
                    cni:
                      name: none
                  proxy:
                    disabled: true
                  extraManifests:
                    - https://raw.githubusercontent.com/alex1989hu/kubelet-serving-cert-approver/main/deploy/standalone-install.yaml
                    - https://github.com/kubernetes-sigs/metrics-server/releases/latest/download/components.yaml
                  inlineManifests:
                  - name: cilium-values
                    contents: |
                      ---
                      apiVersion: v1
                      kind: ConfigMap
                      metadata:
                        name: cilium-values
                        namespace: kube-system
                      data:
                        values.yaml: |-
                          cluster:
                            name: cluster01
                            id: 1
                          
                          kubeProxyReplacement: true
                          
                          # Talos specific
                          k8sServiceHost: localhost
                          k8sServicePort: 7445
                          securityContext:
                            capabilities:
                              ciliumAgent: [ CHOWN, KILL, NET_ADMIN, NET_RAW, IPC_LOCK, SYS_ADMIN, SYS_RESOURCE, DAC_OVERRIDE, FOWNER, SETGID, SETUID ]
                              cleanCiliumState: [ NET_ADMIN, SYS_ADMIN, SYS_RESOURCE ]
                          
                          cgroup:
                            autoMount:
                              enabled: false
                            hostRoot: /sys/fs/cgroup
                          
                          # https://docs.cilium.io/en/stable/network/concepts/ipam/
                          ipam:
                            mode: kubernetes
                          
                          operator:
                            rollOutPods: true
                            resources:
                              limits:
                                cpu: 500m
                                memory: 256Mi
                              requests:
                                cpu: 50m
                                memory: 128Mi
                          
                          # Roll out cilium agent pods automatically when ConfigMap is updated.
                          rollOutCiliumPods: true
                          resources:
                            limits:
                              cpu: 1000m
                              memory: 1Gi
                            requests:
                              cpu: 200m
                              memory: 512Mi
                          
                          #debug:
                          #  enabled: true
                          
                          # Increase rate limit when doing L2 announcements
                          k8sClientRateLimit:
                            qps: 20
                            burst: 100
                          
                          l2announcements:
                            enabled: true
                          
                          externalIPs:
                            enabled: true
                          
                          ciliumEndpointSlice:
                            enabled: true
                          
                          loadBalancer:
                            # https://docs.cilium.io/en/stable/network/kubernetes/kubeproxy-free/#maglev-consistent-hashing
                            algorithm: maglev
                          
                          gatewayAPI:
                            enabled: true
                          envoy:
                            securityContext:
                              capabilities:
                                keepCapNetBindService: true
                                envoy: [ NET_ADMIN, PERFMON, BPF ]
                          
                          hubble:
                            enabled: true
                            relay:
                              enabled: true
                              rollOutPods: true
                            ui:
                              enabled: true
                              rollOutPods: true
                          
                          ingressController:
                            enabled: false
                            default: true
                            loadbalancerMode: shared
                            service:
                              annotations:
                                io.cilium/lb-ipam-ips: 192.168.1.223
                          
                          # mTLS
                          authentication:
                            enabled: false
                            mutual:
                              spire:
                                enabled: false
                                install:
                                  server:
                                    dataStorage:
                                      storageClass: cilium-spire-sc
                          
                  - name: cilium-bootstrap
                    contents: |
                      ---
                      apiVersion: rbac.authorization.k8s.io/v1
                      kind: ClusterRoleBinding
                      metadata:
                        name: cilium-install
                      roleRef:
                        apiGroup: rbac.authorization.k8s.io
                        kind: ClusterRole
                        name: cluster-admin
                      subjects:
                        - kind: ServiceAccount
                          name: cilium-install
                          namespace: kube-system
                      ---
                      apiVersion: v1
                      kind: ServiceAccount
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      ---
                      apiVersion: batch/v1
                      kind: Job
                      metadata:
                        name: cilium-install
                        namespace: kube-system
                      spec:
                        backoffLimit: 10
                        template:
                          metadata:
                            labels:
                              app: cilium-install
                          spec:
                            restartPolicy: OnFailure
                            tolerations:
                              - operator: Exists
                              - effect: NoSchedule
                                operator: Exists
                              - effect: NoExecute
                                operator: Exists
                              - effect: PreferNoSchedule
                                operator: Exists
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoSchedule
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: NoExecute
                              - key: node-role.kubernetes.io/control-plane
                                operator: Exists
                                effect: PreferNoSchedule
                            affinity:
                              nodeAffinity:
                                requiredDuringSchedulingIgnoredDuringExecution:
                                  nodeSelectorTerms:
                                    - matchExpressions:
                                        - key: node-role.kubernetes.io/control-plane
                                          operator: Exists
                            serviceAccountName: cilium-install
                            hostNetwork: true
                            containers:
                              - name: cilium-install
                                image: quay.io/cilium/cilium-cli-ci:latest
                                env:
                                  - name: KUBERNETES_SERVICE_HOST
                                    valueFrom:
                                      fieldRef:
                                        apiVersion: v1
                                        fieldPath: status.podIP
                                  - name: KUBERNETES_SERVICE_PORT
                                    value: "6443"
                                volumeMounts:
                                  - name: values
                                    mountPath: /root/app/values.yaml
                                    subPath: values.yaml
                                command:
                                  - cilium
                                  - install
                                  - --version=v1.16.3 # renovate: github-releases=cilium/cilium
                                  - --set
                                  - kubeProxyReplacement=true
                                  - --values
                                  - values.yaml
                            volumes:
                              - name: values
                                configMap:
                                  name: cilium-values
            EOT,
        ]
      + endpoint                    = "192.168.1.210"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "192.168.1.210"
    }

  # module.talos.talos_machine_configuration_apply.worker_config_apply[0] will be created
  + resource "talos_machine_configuration_apply" "worker_config_apply" {
      + apply_mode                  = "auto"
      + client_configuration        = (known after apply)
      + config_patches              = [
          + <<-EOT
                machine:
                  network:
                    hostname: talos-worker-01
                  kubelet:
                    extraArgs:
                      rotate-server-certificates: true
                  nodeLabels:
                    topology.kubernetes.io/region: cluster01
                    topology.kubernetes.io/zone: pve01
            EOT,
        ]
      + endpoint                    = "192.168.1.211"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "192.168.1.211"
    }

  # module.talos.talos_machine_secrets.machine_secrets will be created
  + resource "talos_machine_secrets" "machine_secrets" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.11"
    }

  # module.traefik.null_resource.traefik_config_sync will be created
  + resource "null_resource" "traefik_config_sync" {
      + id       = (known after apply)
      + triggers = {
          + "tcp_routers_hash"    = "01555144bc0c83d93b289f543092b012"
          + "traefik_config_hash" = "f422520c6ed3fdd89a73387d52ece275"
        }
    }

  # module.traefik.proxmox_virtual_environment_container.traefik will be created
  + resource "proxmox_virtual_environment_container" "traefik" {
      + description    = <<-EOT
            Managed by Terraform
        EOT
      + id             = (known after apply)
      + ipv4           = (known after apply)
      + ipv6           = (known after apply)
      + node_name      = "pve01"
      + protection     = false
      + start_on_boot  = true
      + started        = true
      + template       = false
      + timeout_clone  = 1800
      + timeout_create = 1800
      + timeout_delete = 60
      + timeout_start  = 300
      + timeout_update = 1800
      + unprivileged   = true
      + vm_id          = (known after apply)

      + disk {
          + acl          = false
          + datastore_id = "local-lvm"
          + quota        = false
          + replicate    = false
          + size         = 2
        }

      + initialization {
          + hostname = "traefik"

          + ip_config {
              + ipv4 {
                  + address = "192.168.1.4/24"
                  + gateway = "192.168.1.1"
                }
            }

          + user_account {
              + keys     = (known after apply)
              + password = (sensitive value)
            }
        }

      + memory {
          + dedicated = 512
          + swap      = 512
        }

      + network_interface {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = false
          + mac_address = (known after apply)
          + mtu         = 0
          + name        = "eth0"
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + template_file_id = (known after apply)
          + type             = "ubuntu"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }
    }

  # module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img will be created
  + resource "proxmox_virtual_environment_download_file" "latest_ubuntu_20_focal_lxc_img" {
      + content_type        = "vztmpl"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "pve01"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "http://download.proxmox.com/images/system/ubuntu-20.04-standard_20.04-1_amd64.tar.gz"
      + verify              = true
    }

  # module.traefik.random_password.ubuntu_container_password will be created
  + resource "random_password" "ubuntu_container_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.traefik.tls_private_key.ubuntu_container_key will be created
  + resource "tls_private_key" "ubuntu_container_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + kubeconfig_content            = (sensitive value)
  + talosconfig                   = (sensitive value)
  + traefik_container_password    = (sensitive value)
  + traefik_container_private_key = (sensitive value)
  + traefik_container_public_key  = (known after apply)

```
*Triggered by @ravilushqa*